ГТС/УТГТС/Documents/ЗаявкаНаТранспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаТранспорт</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявокНаТранспорт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПолучаемыхНаличных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаЧейСчетДоставка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаЧейСчетДоставка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПлательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаСчетКомпании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКартойДистанционная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаДопУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийВнутр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзятоВРаботу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСклад</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>8</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/ASP_ГарантийныеТалоны.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ASP_ГарантийныеТалоны</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТиповыеУсловия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/Documents/ЗаявкаНаТранспорт/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция СформироватьРеестрДокументовНаСевере()
	Отчет = Отчеты.РеестрЗаявокНаТранспорт.Создать();
	
	Для каждого ПараметрОтчета Из Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		//Если СокрЛП(ПараметрОтчета.Параметр) = "НачДата" Тогда
		//	Если ЗначениеЗаполнено(ЭтаФорма.ПодчиненныеЭлементы.Список.Период.ДатаНачала) Тогда
		//		ПараметрОтчета.Значение = ЭтаФорма.ПодчиненныеЭлементы.Список.Период.ДатаНачала;
		//	КонецЕсли;	
		//ИначеЕсли СокрЛП(ПараметрОтчета.Параметр) = "КонДата" Тогда
		//	Если ЗначениеЗаполнено(ЭтаФорма.ПодчиненныеЭлементы.Список.Период.ДатаОкончания) Тогда
		//		ПараметрОтчета.Значение = ЭтаФорма.ПодчиненныеЭлементы.Список.Период.ДатаОкончания;
		//	КонецЕсли;	
		//КонецЕсли;
		Если СокрЛП(ПараметрОтчета.Параметр) = "Период" Тогда
			Если ЗначениеЗаполнено(ЭтаФорма.ПодчиненныеЭлементы.Список.Период.ДатаНачала) ИЛИ ЗначениеЗаполнено(ЭтаФорма.ПодчиненныеЭлементы.Список.Период.ДатаОкончания) Тогда
				ПараметрОтчета.Значение = ЭтаФорма.ПодчиненныеЭлементы.Список.Период;
				ПараметрОтчета.Использование = Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
		
	Отбор = Отчет.КомпоновщикНастроек.Настройки.Отбор;
	
	Для каждого ЭлементОтбора Из Отбор.Элементы Цикл
		Если СокрЛП(ЭлементОтбора.ЛевоеЗначение) = "Менеджер" И ЗначениеЗаполнено(ОтборМенеджер) Тогда
			ЭлементОтбора.ПравоеЗначение = ОтборМенеджер;
			ЭлементОтбора.Использование = Истина;
		ИначеЕсли СокрЛП(ЭлементОтбора.ЛевоеЗначение) = "Статус" И ЗначениеЗаполнено(ОтборСтатус) Тогда
			ЭлементОтбора.ПравоеЗначение = ОтборСтатус;
			ЭлементОтбора.Использование = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	// Компоновка макета компоновки данных.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(Отчет.СхемаКомпоновкиДанных, Отчет.КомпоновщикНастроек.Настройки);
	
	// Построение табличного документа.
	ТабДок = Новый ТабличныйДокумент;
	
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(МакетКомпоновкиДанных);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ТабДок);
    ПроцессорВывода.Вывести(Процессор);

	Возврат ТабДок;
	
КонецФункции//СформироватьРеестрДокументовНаСевере()	

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Статус", ОтборСтатус, , , ЗначениеЗаполнено(ОтборСтатус));
КонецПроцедуры

&НаКлиенте
Процедура ОтборМенеджерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Менеджер", ОтборМенеджер, , , ЗначениеЗаполнено(ОтборМенеджер));
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОтборМенеджер  = Настройки.Получить("ОтборМенеджер");
	ОтборСтатус = Настройки.Получить("ОтборСтатус");
	Подразделение  = Настройки.Получить("Подразделение");
	ОтборСклад  = Настройки.Получить("ОтборСклад");
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Менеджер",  ОтборМенеджер, , , ЗначениеЗаполнено(ОтборМенеджер));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Статус", ОтборСтатус, , , ЗначениеЗаполнено(ОтборСтатус));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Подразделение", Подразделение, , , ЗначениеЗаполнено(Подразделение));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", ОтборСклад, , , ЗначениеЗаполнено(ОтборСклад));

КонецПроцедуры

&НаКлиенте
Процедура ПечатьРеестраДокументов(Команда)
	ТабДок = СформироватьРеестрДокументовНаСевере();
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюПечать);
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//ASP_Dante 05/09/19 добавил подключаемые команды
	//ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	//МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//ASP_Dante 05/09/19
	//ОбщегоНазначенияУТ.УстановитьУсловноеОформлениеПоляДата(ЭтотОбъект, "Список", "Дата");
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Подразделение", Подразделение, , , ЗначениеЗаполнено(Подразделение));
КонецПроцедуры

#Область СтандартныеПодсистемыПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПлановаяДатаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ПланируемаяДатаДоставки", ОтборПлановаяДата, , , ЗначениеЗаполнено(ОтборПлановаяДата));
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладПриИзменении(Элемент)
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Склад", ОтборСклад, , , ЗначениеЗаполнено(ОтборСклад));
КонецПроцедуры

//ГТС Получаем номера УПД для заявок на транспорт
&НаСервереБезКонтекста
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	КлючиСтрок = Строки.ПолучитьКлючи();
	ЗаявкиНаТранспорт = Новый Массив;
	
	Для Каждого КлючСтроки Из КлючиСтрок Цикл
		СтрокаСписка = Строки[КлючСтроки];
		Попытка
			СтрокаСписка.Данные.НомерСФ = "";
			Если ЗначениеЗаполнено(СтрокаСписка.Данные.Ссылка) Тогда
				ЗаявкиНаТранспорт.Добавить(СтрокаСписка.Данные.Ссылка);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	Если ЗаявкиНаТранспорт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураВыданный.Номер КАК Номер,
		|	РеализацияТоваровУслуг.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО РеализацияТоваровУслуг.Ссылка = СчетФактураВыданный.ДокументОснование
		|ГДЕ
		|	РеализацияТоваровУслуг.ЗаявкаНаТранспорт В (&ЗаявкиНаТранспорт)
		|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ЗаявкиНаТранспорт", ЗаявкиНаТранспорт);
	Выборка = Запрос.Выполнить().Выбрать();
	НомераПоЗаявкам = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		Номера = НомераПоЗаявкам.Получить(Выборка.ЗаявкаНаТранспорт);
		Если Номера = Неопределено Тогда
			Номера = "";
		КонецЕсли;
		Номера = Номера + " "
			+ Строка(ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер, Истина, Истина));
		НомераПоЗаявкам.Вставить(Выборка.ЗаявкаНаТранспорт, Номера);
	КонецЦикла;
	
	Для Каждого КлючСтроки Из КлючиСтрок Цикл
		СтрокаСписка = Строки[КлючСтроки];
		Попытка
			Номера = НомераПоЗаявкам.Получить(СтрокаСписка.Данные.Ссылка);
			Если Номера <> Неопределено Тогда
				СтрокаСписка.Данные.НомерСФ = Номера;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВзятьВРаботуНаСервере()
	Если ЗначениеЗаполнено(Элементы.Список.ВыделенныеСтроки)  Тогда 
		ВзятоКол=0;
		Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.ЗаявкаНаТранспорт = &ЗаявкаНаТранспорт";
			
			Запрос.УстановитьПараметр("ЗаявкаНаТранспорт", ВыделеннаяСтрока.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				РеализацияОбъект=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				РеализацияОбъект.ПринятоВРаботу=ТекущаяДата();
				РеализацияОбъект.Записать();
				ВзятоКол=ВзятоКол+1;
			КонецЦикла;
			
			
			
		КонецЦикла;
		Сообщить("Взято в работу документов: " + ВзятоКол);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВзятьВРаботу(Команда)
	ВзятьВРаботуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтметкаСкладаНаСервере() 
	
	Если ЗначениеЗаполнено(Элементы.Список.ВыделенныеСтроки) И (РольДоступна("ASP_ОтметкаСклада") или РольДоступна("ПолныеПрава")) Тогда 
		ВзятоКол=0;
		Для Каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.ЗаявкаНаТранспорт = &ЗаявкаНаТранспорт";
			
			Запрос.УстановитьПараметр("ЗаявкаНаТранспорт", ВыделеннаяСтрока.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл      
				Если ВыполнитьПроверкуНаличияГарантии(ВыборкаДетальныеЗаписи.Ссылка) Тогда
				РеализацияОбъект=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				РеализацияОбъект.ОтметкаСклада=ТекущаяДата();
				РеализацияОбъект.Записать();
				ВзятоКол=ВзятоКол+1;  
				Иначе Сообщить ("По реализации " + ВыборкаДетальныеЗаписи.Ссылка + " требуется оформление и заполнение серийным номером гарантии");
				КонецЕсли;
					
				КонецЦикла;
			
			
			
		КонецЦикла;
		Сообщить("Отметка склада установлена в документах: " + ВзятоКол);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтметкаСклада(Команда)
	ОтметкаСкладаНаСервере();
КонецПроцедуры        

&НаСервере
Функция ВыполнитьПроверкуНаличияГарантии(ДокументРеализации) 
	Итог=истина;
	Если ДокументРеализации.Дата>='20231001' 
		Тогда
		//ОбъектФормы = РеквизитФормыВЗначение("Объект");
		Товары=ДокументРеализации.Товары.Выгрузить();
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТЧ.Номенклатура КАК Номенклатура
		               |ПОМЕСТИТЬ ТЧ
		               |ИЗ
		               |	&ТЧ КАК ТЧ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТЧ.Номенклатура КАК Номенклатура,
		               |	Номенклатура1.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии
		               |ИЗ
		               |	ТЧ КАК ТЧ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		               |		ПО ТЧ.Номенклатура = Номенклатура1.Ссылка
		               |ГДЕ
		               |	Номенклатура1.ВидНоменклатуры.ИспользоватьСерии = ИСТИНА
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТЧ.Номенклатура,
		               |	Номенклатура1.ВидНоменклатуры.ИспользоватьСерии";
		Запрос.УстановитьПараметр("ТЧ", Товары);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл   
			Итог=Ложь;
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ASP_ГарантийныеТалоны.Номенклатура КАК Номенклатура,
				|	ASP_ГарантийныеТалоны.СерийныйНомер КАК СерийныйНомер,
				|	ASP_ГарантийныеТалоны.Реализация КАК Реализация
				|ИЗ
				|	РегистрСведений.ASP_ГарантийныеТалоны КАК ASP_ГарантийныеТалоны
				|ГДЕ
				|	ASP_ГарантийныеТалоны.Реализация = &Реализация
				|	И ASP_ГарантийныеТалоны.Номенклатура = &Номенклатура
				|
				|УПОРЯДОЧИТЬ ПО
				|	СерийныйНомер";
			
			Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
			Запрос.УстановитьПараметр("Реализация", ДокументРеализации);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СерийныйНомер) Тогда
				Итог=Ложь;
				Прервать; 
				Иначе 
				Итог=Истина;
				Прервать;
				КонецЕсли;	
			КонецЦикла;
	

	
		КонецЦикла;
        Возврат Итог;
	КонецЕсли;
КонецФункции


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
